app/views/cart/checkout.html.erb

<div class="well">
  <% @order.order_items.each do |k, v| %>
  	<ul>
  		<li><%= Product.find(k).name %>, <%= v %></li>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 11]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]