app/controllers/application_controller.rb

	def fetch_brands
		@brands = Product.pluck(:brand).sort.uniq
---
SELECT "products"."brand" FROM "products"

	def current_order
		if !session[:order_id].nil?
			Order.find(session[:order_id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]