app/controllers/cart_controller.rb

INSERT INTO "line_items" ("product_id", "quantity", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 3], ["quantity", 2], ["order_id", 10], ["created_at", "2018-08-16 14:34:57.517106"], ["updated_at", "2018-08-16 14:34:57.517106"]]
INSERT INTO "orders" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-08-16 14:34:57.481096"], ["updated_at", "2018-08-16 14:34:57.481096"]]
---
  def add_to_cart
    @order = current_order
  	line_item = @order.line_items.new(product_id: params[:product_id], quantity: params[:quantity])
    @order.save

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 11]]
UPDATE "line_items" SET "line_item_total" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["line_item_total", 160.0], ["updated_at", "2018-08-16 14:35:17.082893"], ["id", 22]]
UPDATE "orders" SET "user_id" = ?, "subtotal" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["user_id", 2], ["subtotal", 0.0], ["updated_at", "2018-08-16 14:35:51.014580"], ["id", 11]]
UPDATE "products" SET "quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["quantity", 13], ["updated_at", "2018-08-16 14:35:51.024877"], ["id", 3]]
INSERT INTO "orders" ("subtotal", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["subtotal", 0.0], ["user_id", 1], ["created_at", "2018-08-15 15:08:14.433065"], ["updated_at", "2018-08-15 15:08:14.433065"]]
UPDATE "orders" SET "order_items" = ?, "subtotal" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_items", "---\n3: 2\n6: 1\n"], ["subtotal", 170.0], ["updated_at", "2018-08-16 14:35:51.042693"], ["id", 11]]
UPDATE "orders" SET "sales_tax" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["sales_tax", 13.6], ["updated_at", "2018-08-16 14:35:51.050843"], ["id", 11]]
UPDATE "orders" SET "grand_total" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["grand_total", 183.6], ["updated_at", "2018-08-16 14:35:51.058139"], ["id", 11]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 22]]
---
  def checkout
  	line_items = current_order.line_items

    unless line_items.length == 0
      current_order.update(user_id: current_user.id, subtotal: 0)

  	   @order = current_order


  	line_items.each do |line_item|
  		line_item.product.update(quantity: (line_item.product.quantity - line_item.quantity))

  		@order.order_items[line_item.product_id] = line_item.quantity
  		@order.subtotal += line_item.line_item_total
  	end

  	@order.save
  	@order.update(sales_tax: (@order.subtotal * 0.08))
  	@order.update(grand_total: (@order.sales_tax + @order.subtotal))

  	line_items.destroy_all

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 33]]
---
  def remove_from_cart
    line_item = LineItem.find(params[:line_item_id])
    line_item.destroy

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def order_complete
    @order = Order.find(params[:order_id])